[
    {
        "year": 1009,
        "event": "First mention of Lithuania in writing, tied to the murder of St. Bruno by likely pagan Lithuanians."
    },
    {
        "year": 1253,
        "event": "King Mindaugas's coronation solidified Lithuania, preventing conquest by Crusaders and initiating rapid expansion."
    },
    {
        "year": 1385,
        "event": "The Union of Krėva brought Lithuanian Christianity and an alliance with Poland, ending crusades against Lithuania."
    },
    {
        "year": 1410,
        "event": "The Battle of Žalgiris marked Lithuania and Poland's victory over the Teutonic Knights, showcasing Lithuania's medieval power."
    },
    {
        "year": 1503,
        "event": "Lithuania ceded one-third of its land to Muscovy, starting the enduring 'Russian menace.'"
    },
    {
        "year": 1569,
        "event": "The Union of Lublin united Poland and Lithuania, reducing Lithuania's status but restoring regional strength."
    },
    {
        "year": 1655,
        "event": "The Deluge devastated Lithuania and Vilnius, marking the decline of the Polish-Lithuanian Commonwealth."
    },
    {
        "year": 1795,
        "event": "The Third Partition of Poland-Lithuania ended the Commonwealth, with most of Lithuania under Russian control."
    },
    {
        "year": 1864,
        "event": "The Russian Empire's Lithuanian language ban fueled the Lithuanian National Revival."
    },
    {
        "year": 1915,
        "event": "German occupation during World War I raised Lithuanian hopes for independence."
    },
    {
        "year": 1918,
        "event": "Lithuania declared independence, restoring sovereignty for the first time since 1569."
    },
    {
        "year": 1920,
        "event": "Poland's annexation of Vilnius ended the dream of a united Polish-Lithuanian state."
    },
    {
        "year": 1923,
        "event": "The Klaipėda Revolt reunited Lithuania-proper with Lithuania Minor, securing international recognition."
    },
    {
        "year": 1940,
        "event": "The Soviet Union occupied Lithuania, initiating genocide and oppression."
    },
    {
        "year": 1941,
        "event": "Nazi Germany occupied Lithuania, halting Soviet oppression but initiating the Holocaust."
    },
    {
        "year": 1944,
        "event": "The Soviet re-occupation brought genocide, guerilla resistance, and economic stagnation."
    },
    {
        "year": 1989,
        "event": "The Baltic Way symbolized Baltic unity against Soviet rule and boosted hopes for independence."
    },
    {
        "year": 1990,
        "event": "Lithuania became the first Soviet republic to declare independence, accelerating the USSR's collapse."
    },
    {
        "year": 1991,
        "event": "Lithuanians protected their independence during the January Events, leading to global recognition."
    },
    {
        "year": 2004,
        "event": "Lithuania joined the European Union, integrating economically and politically but losing population to emigration."
    },
    {
        "year": 2004,
        "event": "Lithuania joined an international military alliance NATO."
    }
]